HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxI2c_regdef.h
/** \\brief  Received Packet Size Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_RPSSTAT_Bits B;
} Ifx_I2C_RPSSTAT;

/** \\brief  RUN Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_RUNCTRL_Bits B;
} Ifx_I2C_RUNCTRL;

/** \\brief  Reception Data Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_RXD_Bits B;
} Ifx_I2C_RXD;

/** \\brief  Timing Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_TIMCFG_Bits B;
} Ifx_I2C_TIMCFG;

/** \\brief  Transmit Packet Size Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_TPSCTRL_Bits B;
} Ifx_I2C_TPSCTRL;

/** \\brief  Transmission Data Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_TXD_Bits B;
} Ifx_I2C_TXD;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_I2c_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  I2C object */
typedef volatile struct _Ifx_I2C
{
    Ifx_I2C_CLC1 CLC1;                      /**< \brief 0, Clock Control 1 Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_I2C_ID ID;                          /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_I2C_RUNCTRL RUNCTRL;                /**< \brief 10, RUN Control Register */
    Ifx_I2C_ENDDCTRL ENDDCTRL;              /**< \brief 14, End Data Control Register */
    Ifx_I2C_FDIVCFG FDIVCFG;                /**< \brief 18, Fractional Divider Configuration Register */
    Ifx_I2C_FDIVHIGHCFG FDIVHIGHCFG;        /**< \brief 1C, Fractional Divider High-speed Mode Configuration Register */
    Ifx_I2C_ADDRCFG ADDRCFG;                /**< \brief 20, Address Configuration Register */
    Ifx_I2C_BUSSTAT BUSSTAT;                /**< \brief 24, Bus Status Register */
    Ifx_I2C_FIFOCFG FIFOCFG;                /**< \brief 28, FIFO Configuration Register */
    Ifx_I2C_MRPSCTRL MRPSCTRL;              /**< \brief 2C, Maximum Received Packet Size Control Register */
    Ifx_I2C_RPSSTAT RPSSTAT;                /**< \brief 30, Received Packet Size Status Register */
    Ifx_I2C_TPSCTRL TPSCTRL;                /**< \brief 34, Transmit Packet Size Control Register */
    Ifx_I2C_FFSSTAT FFSSTAT;                /**< \brief 38, Filled FIFO Stages Status Register */
    unsigned char reserved_3C[4];           /**< \brief 3C, \internal Reserved */
    Ifx_I2C_TIMCFG TIMCFG;                  /**< \brief 40, Timing Configuration Register */
    unsigned char reserved_44[28];          /**< \brief 44, \internal Reserved */
    Ifx_I2C_ERRIRQSM ERRIRQSM;              /**< \brief 60, Error Interrupt Request Source Mask Register */
    Ifx_I2C_ERRIRQSS ERRIRQSS;              /**< \brief 64, Error Interrupt Request Source Status Register */
    Ifx_I2C_ERRIRQSC ERRIRQSC;              /**< \brief 68, Error Interrupt Request Source Clear Register */
    unsigned char reserved_6C[4];           /**< \brief 6C, \internal Reserved */
    Ifx_I2C_PIRQSM PIRQSM;                  /**< \brief 70, Protocol Interrupt Request Source Mask Register */
    Ifx_I2C_PIRQSS PIRQSS;                  /**< \brief 74, Protocol Interrupt Request Source Status Register */
    Ifx_I2C_PIRQSC PIRQSC;                  /**< \brief 78, Protocol Interrupt Request Source Clear Register */
    unsigned char reserved_7C[4];           /**< \brief 7C, \internal Reserved */
    Ifx_I2C_RIS RIS;                        /**< \brief 80, Raw Interrupt Status Register */
    Ifx_I2C_IMSC IMSC;                      /**< \brief 84, Interrupt Mask Control Register */
    Ifx_I2C_MIS MIS;                        /**< \brief 88, Masked Interrupt Status Register */
    Ifx_I2C_ICR ICR;                        /**< \brief 8C, Interrupt Clear Register */
    Ifx_I2C_ISR ISR;                        /**< \brief 90, Interrupt Set Register */
    unsigned char reserved_94[32620];       /**< \brief 94, \internal Reserved */
    Ifx_I2C_TXD TXD;                        /**< \brief 8000, Transmission Data Register */
    unsigned char reserved_8004[16380];     /**< \brief 8004, \internal Reserved */
    Ifx_I2C_RXD RXD;                        /**< \brief C000, Reception Data Register */
    unsigned char reserved_C004[16380];     /**< \brief C004, \internal Reserved */
    Ifx_I2C_CLC CLC;                        /**< \brief 10000, Clock Control Register */
    Ifx_I2C_MODID MODID;                    /**< \brief 10004, Module Identification Register */
    Ifx_I2C_GPCTL GPCTL;                    /**< \brief 10008, General Purpose Control Register */
    Ifx_I2C_ACCEN0 ACCEN0;                  /**< \brief 1000C, Access Enable Register 0 */
    Ifx_I2C_ACCEN1 ACCEN1;                  /**< \brief 10010, Access Enable Register 1 */
    Ifx_I2C_KRST0 KRST0;                    /**< \brief 10014, Kernel Reset Register 0 */
    Ifx_I2C_KRST1 KRST1;                    /**< \brief 10018, Kernel Reset Register 1 */
    Ifx_I2C_KRSTCLR KRSTCLR;                /**< \brief 1001C, Kernel Reset Status Clear Register */
    unsigned char reserved_10020[224];      /**< \brief 10020, \internal Reserved */
} Ifx_I2C;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXI2C_REGDEF_H */
